controllers/SiteController.php

INSERT INTO `appointments` (`user_id`, `scheduled_date`, `scheduled_time`, `appointment_type`, `status`, `created_at`) VALUES (1, '2025-03-15', '17:51', 'services-request', 'pending', '2025-03-10 10:51:51')
---
    public function actionCreateAppointment()
    {
        Yii::$app->response->format = Response::FORMAT_JSON;
        $model = new Appointment();

        if ($model->load(Yii::$app->request->post(), '') && $model->save()) {

SELECT * FROM `appointments`
---
    public function actionGetAppointment()
    {
        Yii::$app->response->format = Response::FORMAT_JSON;
        $appointments = Appointment::find()->all();

SELECT * FROM `appointments` WHERE `scheduled_date`='2025-02-28'
---
    public function actionGetAppointmentsForDate($date)
    {
        Yii::$app->response->format = Response::FORMAT_JSON;
        $formatted_date = date('Y-m-d', strtotime($date));
        $appointments = Appointment::find()
            ->where(['scheduled_date' => $formatted_date])
            ->all();

SELECT * FROM `appointments` WHERE `appointment_id`='4'
DELETE FROM `appointments` WHERE `appointment_id`=4
---
    public function actionDeleteAppointment()
    {
        Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $id = Yii::$app->request->post('id');

        if (!$id) {
            return [
                'status' => 'error',
                'message' => 'No appointment ID provided'
            ];
        }

        $model = Appointment::findOne($id);

        if (!$model) {
            return [
                'status' => 'error',
                'message' => 'Appointment not found!'
            ];
        }

        if ($model->delete()) {